# Configuring cisco switch (my attempt)

---

- enable - idk after this and eventual passwd you can start doing and setting stuff
- configure terminal - start to configure

```sh
Switch> enable
Switch# configure terminal
```

---

- vlan [number] - create vlan
- name [name] - then you can name it

```sh
Switch(config)# vlan 10
Switch(config-vlan)# name RedSide
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name BlueSide
Switch(config-vlan)# exit
```

---

- interface range Gi2/0/1 - 12 - you have to check how are ports are called, and assign them accordingly.
- switchport mode access
- switchport access vlan 20 - and then you can assign these ports to prev. created vlan :)

```sh
Switch(config)# interface range Gi2/0/1 - 12
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# exit
```

```sh
Switch(config)# interface range Gi2/0/12 - 24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# exit
```

---

- show vlan brief - then you can look how it looks like
- show interface status
- write memory - and if it's all g, you can write it

```sh
Switch# show interface status
Switch# show vlan brief
Switch# write memory
```
